package lesson_27;

public class Quiz {

    /*
     С помощью какого механизма можно избежать дублирования кода в двух классах?
     - Наследование

     С помощью какого ключевого слова мы наследуемся
     - extends

     A extends B - где предок, ге потомок?
     А - потомок
     В - предок

     С помощью какого модификатора можно сделать так чтоб поле или метод были доступны в потомке?
     - protected
     - public

     Какие элементы класса-предка (родителя) копируются в классы-потомки?
     - поля
     - методы
     - НЕ копируются конструкторы

     Как принудительно вызвать конструктор предка в конструкторе потомка?
     - super()

     Что будет если конструкторе потомка не вызвать явно конструктор предка?
     - Java попытается вызвать пустой конструктор предка (super())
     - а если такого конструктора нет - будет ошибка компиляции

     */

}
